alvieboy/ZXInterfaceZ/esp32/main/sna_defs.h
#ifndef __SNA_DEFS_H__
#define __SNA_DEFS_H__

#define SNA_RAM_BASE (0x2000)

#define SNA_RAM_OFF(delta) ( SNA_RAM_BASE+(delta) )

#define SNA_RAM_CHUNK2_SIZE 0xA000
#define SNA_RAM_CHUNK1_SIZE 0x2000


#define SNA_RAM_OFF_C   SNA_RAM_OFF(0x0000)
#define SNA_RAM_OFF_B   SNA_RAM_OFF(0x0001)
#define SNA_RAM_OFF_E   SNA_RAM_OFF(0x0002)
#define SNA_RAM_OFF_D   SNA_RAM_OFF(0x0003)
#define SNA_RAM_OFF_L   SNA_RAM_OFF(0x0004)
#define SNA_RAM_OFF_H   SNA_RAM_OFF(0x0005)
#define SNA_RAM_OFF_YMMIX   SNA_RAM_OFF(0x0006)

#define SNA_RAM_OFF_CHUNK1 SNA_RAM_OFF(0x0010)

#define SNA_RAM_OFF_CHUNK1_ADDR 0x4000

#define SNA_RAM_OFF_SPL SNA_RAM_OFF(0x2010)
#define SNA_RAM_OFF_SPH SNA_RAM_OFF(0x2011)
#define SNA_RAM_OFF_IXL SNA_RAM_OFF(0x2012)
#define SNA_RAM_OFF_IXH SNA_RAM_OFF(0x2013)
#define SNA_RAM_OFF_IYL SNA_RAM_OFF(0x2014)
#define SNA_RAM_OFF_IYH SNA_RAM_OFF(0x2015)
#define SNA_RAM_OFF_F   SNA_RAM_OFF(0x2016)
#define SNA_RAM_OFF_A   SNA_RAM_OFF(0x2017)
#define SNA_RAM_OFF_R   SNA_RAM_OFF(0x2018)
#define SNA_RAM_OFF_IFF2 SNA_RAM_OFF(0x2019)
#define SNA_RAM_OFF_I   SNA_RAM_OFF(0x201A)
#define SNA_RAM_OFF_BORDER SNA_RAM_OFF(0x201B)

#define SNA_RAM_OFF_Calt SNA_RAM_OFF(0x201C)
#define SNA_RAM_OFF_Balt SNA_RAM_OFF(0x201D)
#define SNA_RAM_OFF_Ealt SNA_RAM_OFF(0x201E)
#define SNA_RAM_OFF_Dalt SNA_RAM_OFF(0x201F)
#define SNA_RAM_OFF_Lalt SNA_RAM_OFF(0x2020)
#define SNA_RAM_OFF_Halt SNA_RAM_OFF(0x2021)
#define SNA_RAM_OFF_Falt SNA_RAM_OFF(0x2022)
#define SNA_RAM_OFF_Aalt SNA_RAM_OFF(0x2023)
#define SNA_RAM_OFF_IMM  SNA_RAM_OFF(0x2024)

#define SNA_RAM_OFF_CHUNK2 SNA_RAM_OFF(0x2025)

#endif
